Tekla Open API Reference for Tekla Structures 2025
SymbolElement.Color Property
 This property is the symbol color.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DrawingColors Color { get; set; }
Public Property Color As DrawingColors
	Get
	Set
Property Value
Type: DrawingColors
See Also
Reference
SymbolElement Class
Tekla.Structures.Drawing Namespace